Repository: AginSquash/open2fa
Catalog: open2fa/Locale/*.lproj/Localizable.strings
Languages: ru

source: For start using Open2FA, create a password
ru: Для начала использования Open2FA, придумайте пароль

source: Create
ru: Создать

source: Unlock
ru: Разблокировать

source: Please authenticate to unlock your codes
ru: Пожалуйста аутентифицируйтесь для разблокировки

source: Already used Open2FA?
ru: Уже пользовались Open2FA?

source: FaceID and TouchID will be not available
ru: FaceID и TouchID будут недоступны

source: 🔐 Enable %@
ru: 🔐 Включить %@

source: 🔐 Enable FaceID / TouchID
ru: 🔐 Включить FaceID / TouchID

source: ☁️ Enable iCloud
ru: ☁️ Включить iCloud

source: Please, enter your password
ru: Пожалуйста, введите ваш пароль

source: Retry
ru: Повторить

source: Error
ru: Ошибка

source: - or -
ru: - или -

source: Import
ru: Импортировать

source: Password is incorrect
ru: Неверный пароль

source: Passwords don't match
ru: Пароли не совпадают

source: Please create password
ru: Придумайте пароль

source: Re-enter password
ru: Введите пароль еще раз

source: If you have already used Open2FA, please enter your password and select the file using button below.
ru: Если вы уже пользовались Open2FA, введите свой пароль и выберите файл с помощью кнопки ниже.

source: Password
ru: Пароль

source: Imported!
ru: Импортировано!

source: Your o2fa file was imported successfully!
ru: Ваш o2fa файл был успешно импортирован!

source: Copied!
ru: Скопировано!

source: Incorrect password
ru: Неверный пароль

source: Preferences
ru: Настройки

source: Settings
ru: Настройки

source: Please, restart app and enter password to appear change
ru: Пожалуйста, перезапустите приложение и введите пароль, чтобы применить изменения

source: Enable Cloud Sync
ru: Включить синхронизацию iCloud

source: Export
ru: Экспорт

source: Credits
ru: О приложении

source: Edit and Delete
ru: Редактирвоание и удаление

source: Share & Edit
ru: Поделиться & Изменить

source: Tap to share or edit, swipe from right edge to the left to
ru: Нажмите, чтобы поделиться или отредактировать, проведите пальцем от правого края влево, чтобы

source: Enable FaceID / TouchID
ru: Включить FaceID / TouchID

source: delete
ru: удалить

source: Delete
ru: Удалить

source: Are you sure want to delete %@?
ru: Вы уверены, что хотите удалить %@?

source: This action is irreversible
ru: Это действие необратимо

source: You already have data in iCloud. To continue, you must delete the data from the cloud.
ru: У вас уже есть данные в iCloud. Чтобы продолжить, вы должны удалить данные из облака.

source: License
ru: Лицензия

source: This software is provided 'as-is', without any express or implied warranty.
ru: Это программное обеспечение предоставляется "как есть", без каких-либо явных или подразумеваемых гарантий.

source: In no event will the authors be held liable for any damages arising from the use of this software.
ru: Автор не несет ответственности за любой ущерб, возникший в результате использования данного программного обеспечения.

source: Source code is available on GitHub:
ru: Исходный код доступен на GitHub:

source: Privacy Policy
ru: Политика конфиденциальности

source: In short: we do not collect or share any information.
ru: Кратко: мы не собираем и не передаем никакую информацию.

source: CryptoSwift - Crypto related functions and helpers for Swift
ru: CryptoSwift - Криптографические функции и вспомогательные средства для Swift

source: CodeScanner - SwiftUI framework for scan QR codes and barcodes
ru: CodeScanner - Фреймворк SwiftUI для сканирования QR-кодов и штрих-кодов

source: SwiftOTP - library for generating One Time Passwords (OTP)
ru: SwiftOTP - библиотека для генерации одноразовых паролей (OTP)

source: Notes
ru: Примечания

source: This product includes software developed by the "Marcin Krzyzanowski"
ru: Этот продукт включает программное обеспечение, разработанное "Marcin Krzyzanowski"

source: Acknowledgements
ru: Благодарности

source: Add your accounts using the button above
ru: Добавьте свои учетные записи, используя кнопку выше

source: Add
ru: Добавить

source: Name of your account
ru: Название вашего аккаунта

source: Name
ru: Название

source: Issuer
ru: Издатель

source: Your secret code
ru: Ваш секретный код

source: Code
ru: Код

source: Name cannot be empty
ru: Название не может быть пустым

source: Save
ru: Сохранить

source: Adding new Account
ru: Добавление нового аккаунта

source: Error!
ru: Ошибка

source: Please scan your QR code or close this view for manual input.
ru: Пожалуйста, сканируйте QR-код или закройте это окно для ручного ввода.

source: Close
ru: Закрыть

source: Scan QR code
ru: Сканирование QR кода

source: HOTP currently not supported!
ru: HOTP в настоящее время не поддерживается!

source: Account editing
ru: Редактирование аккаунта

source: Created on
ru: Аккаунт создан

source: Authentication
ru: Аутентификация

source: QR code
ru: QR код

source: Exporting an Account
ru: Экспорт аккаунта

source: For your protection, we need to identify you. Please enter your password below.
ru: Для защиты ваших аккаунтов, нам нужно идентифицировать Вас. Пожалуйста, введите свой пароль ниже.

source: 🔐 All your codes will remain encrypted with AES-256
ru: 🔐 Все ваши коды останутся зашифрованными с помощью AES-256

source: Yes, I understand that I still need to put this file in a safe place.
ru: Да, я понимаю, что мне все равно нужно поместить этот файл в безопасное место

source: Success
ru: Успешно

source: Your file successfully exported!
ru: Ваш файл успешно экспортирован!

source: Still encrypted
ru: Оставить зашифрованным

source: Your codes will not be protected by encryption, which will allow you to import them into other applications. Is an unsafe option
ru: Ваши коды не будут защищены шифрованием, что позволит импортировать их в другие приложения. Является небезопасным вариантом

source: Warning!
ru: Внимание

source: Are you sure? This option will remove encryption from the file, which will make your file vulnerable to hacker attacks
ru: Вы уверены? Эта опция уберет шифрование с файла, что сделает ваш файл подверженным хакерским атакам

source: Export unencrypted
ru: Экспорт незашифрованным

source: Cancel
ru: Отмена

source: iCloud data found
ru: Найдены данные в iCloud

source: Open2FA data has been found in iCloud. You can: - Delete them and start from scratch. - Restore the data from iCloud & enable sync - Disable iCloud sync on this device.
ru: Данные Open2FA были найдены в iCloud. Вы можете: - Удалить их и начать сначала. - Восстановить данные из iCloud и включить синхронизацию. - Отключить синхронизацию iCloud на этом устройстве.

source: Restore data from iCloud and enable synchronization?
ru: Восстановить данные из iCloud и включить синхронизацию?

source: Restore
ru: Восстановить

source: Disable iCloud
ru: Отключить iCloud

source: Are you sure? This action is irreversible
ru: Вы уверены? Это действие нельзя отменить

source: We need use camera for scan QR codes
ru: Нам нужен доступ к камере для сканирования QR-кодов

source: Please identify yourself to unlock the app
ru: Пожалуйтса идентифицируйте себя чтобы разблокировать приложение
